app/controllers/tasks_controller.rb

  def index
    @tasks = Task.all
---
SELECT * FROM "tasks"

  def create
    @task = Task.new(params[:task])

    respond_to do |format|
      if @task.save
---
INSERT INTO "tasks" ("duration", "created_at", "updated_at", "description", "is_finished", "owner") VALUES(NULL, '2010-10-26 23:29:25', '2010-10-26 23:29:25', NULL, NULL, NULL)

  def update
    @task = Task.find(params[:id])

    respond_to do |format|
      if @task.update_attributes(params[:task])
---
SELECT * FROM "tasks" WHERE ("tasks"."id" = 3)
UPDATE "tasks" SET "updated_at" = '2010-10-26 23:51:18', "owner" = 555 WHERE "id" = 3

  def destroy
    @task = Task.find(params[:id])
    @task.destroy
---
SELECT * FROM "tasks" WHERE ("tasks"."id" = 1)
DELETE FROM "tasks" WHERE "id" = 1